; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v8 - type_3 ?v7 - type_1)
 	      (pred_1 ?v4 - object ?v7 - type_1)
	      (pred_2 ?v8 - type_3 ?v3 - type_2)
	      (pred_3 ?v8 - type_3 ?v4 - object ?v3 - type_2))

   (:action op_3
       :parameters  (?v8 - type_3 ?v1 ?v6 - type_1)
       :precondition (and  (pred_4 ?v8 ?v1))
       :effect (and  (pred_4 ?v8 ?v6)
		     (not (pred_4 ?v8 ?v1))))

   (:action op_1
       :parameters (?v8 - type_3 ?v2 - object ?v5 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v5) (pred_4 ?v8 ?v5) (pred_2 ?v8 ?v3))
       :effect (and (pred_3 ?v8 ?v2 ?v3)
		    (not (pred_1 ?v2 ?v5)) 
		    (not (pred_2 ?v8 ?v3))))

   (:action op_2
       :parameters (?v8 - type_3 ?v2 - object ?v5 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v8 ?v2 ?v3) (pred_4 ?v8 ?v5))
       :effect (and (pred_1 ?v2 ?v5)
		    (pred_2 ?v8 ?v3)
		    (not (pred_3 ?v8 ?v2 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_13 obj_12 - type_3
obj_07 obj_05 obj_02 obj_10 - type_2
obj_01 obj_03 obj_11 obj_09 - type_1
obj_04 obj_14 obj_08 obj_06 - object)
(:init
(pred_4 obj_13 obj_11)
(pred_2 obj_13 obj_07)
(pred_2 obj_13 obj_05)
(pred_4 obj_12 obj_01)
(pred_2 obj_12 obj_02)
(pred_2 obj_12 obj_10)
(pred_1 obj_04 obj_03)
(pred_1 obj_14 obj_03)
(pred_1 obj_08 obj_01)
(pred_1 obj_06 obj_03)
)
(:goal
(and
(pred_1 obj_04 obj_09)
(pred_1 obj_14 obj_09)
(pred_1 obj_08 obj_11)
(pred_1 obj_06 obj_09)
)
)

(:constraints
  (always (not (pred_4 obj_13 obj_09)))
)
)

; plan
1. (op_1 obj_12 obj_08 obj_01 obj_10)
   deleted: (pred_1 obj_08 obj_01) (pred_2 obj_12 obj_10)
   added: (pred_3 obj_12 obj_08 obj_10)
   goals met: 0 of 4
2. (op_3 obj_13 obj_11 obj_03)
   deleted: (pred_4 obj_13 obj_11)
   added: (pred_4 obj_13 obj_03)
   goals met: 0 of 4
3. (op_3 obj_12 obj_01 obj_11)
   deleted: (pred_4 obj_12 obj_01)
   added: (pred_4 obj_12 obj_11)
   goals met: 0 of 4
4. (op_1 obj_13 obj_06 obj_03 obj_05)
   deleted: (pred_1 obj_06 obj_03) (pred_2 obj_13 obj_05)
   added: (pred_3 obj_13 obj_06 obj_05)
   goals met: 0 of 4
5. (op_1 obj_13 obj_14 obj_03 obj_07)
   deleted: (pred_1 obj_14 obj_03) (pred_2 obj_13 obj_07)
   added: (pred_3 obj_13 obj_14 obj_07)
   goals met: 0 of 4
6. (op_2 obj_12 obj_08 obj_11 obj_10)
   deleted: (pred_3 obj_12 obj_08 obj_10)
   added: (pred_1 obj_08 obj_11) (pred_2 obj_12 obj_10)
   goals met: 1 of 4
7. (op_2 obj_13 obj_06 obj_03 obj_05)
   deleted: (pred_3 obj_13 obj_06 obj_05)
   added: (pred_1 obj_06 obj_03) (pred_2 obj_13 obj_05)
   goals met: 1 of 4
8. (op_2 obj_13 obj_14 obj_03 obj_07)
   deleted: (pred_3 obj_13 obj_14 obj_07)
   added: (pred_1 obj_14 obj_03) (pred_2 obj_13 obj_07)
   goals met: 1 of 4
9. (op_3 obj_12 obj_11 obj_03)
   deleted: (pred_4 obj_12 obj_11)
   added: (pred_4 obj_12 obj_03)
   goals met: 1 of 4
10. (op_1 obj_12 obj_04 obj_03 obj_10)
   deleted: (pred_1 obj_04 obj_03) (pred_2 obj_12 obj_10)
   added: (pred_3 obj_12 obj_04 obj_10)
   goals met: 1 of 4
11. (op_3 obj_12 obj_03 obj_09)
   deleted: (pred_4 obj_12 obj_03)
   added: (pred_4 obj_12 obj_09)
   goals met: 1 of 4
12. (op_2 obj_12 obj_04 obj_09 obj_10)
   deleted: (pred_3 obj_12 obj_04 obj_10)
   added: (pred_1 obj_04 obj_09) (pred_2 obj_12 obj_10)
   goals met: 2 of 4
13. (op_3 obj_12 obj_09 obj_03)
   deleted: (pred_4 obj_12 obj_09)
   added: (pred_4 obj_12 obj_03)
   goals met: 2 of 4
14. (op_1 obj_12 obj_06 obj_03 obj_10)
   deleted: (pred_1 obj_06 obj_03) (pred_2 obj_12 obj_10)
   added: (pred_3 obj_12 obj_06 obj_10)
   goals met: 2 of 4
15. (op_3 obj_12 obj_03 obj_09)
   deleted: (pred_4 obj_12 obj_03)
   added: (pred_4 obj_12 obj_09)
   goals met: 2 of 4
16. (op_2 obj_12 obj_06 obj_09 obj_10)
   deleted: (pred_3 obj_12 obj_06 obj_10)
   added: (pred_1 obj_06 obj_09) (pred_2 obj_12 obj_10)
   goals met: 3 of 4
17. (op_3 obj_12 obj_09 obj_03)
   deleted: (pred_4 obj_12 obj_09)
   added: (pred_4 obj_12 obj_03)
   goals met: 3 of 4
18. (op_1 obj_12 obj_14 obj_03 obj_10)
   deleted: (pred_1 obj_14 obj_03) (pred_2 obj_12 obj_10)
   added: (pred_3 obj_12 obj_14 obj_10)
   goals met: 3 of 4
19. (op_3 obj_12 obj_03 obj_09)
   deleted: (pred_4 obj_12 obj_03)
   added: (pred_4 obj_12 obj_09)
   goals met: 3 of 4
20. (op_2 obj_12 obj_14 obj_09 obj_10)
   deleted: (pred_3 obj_12 obj_14 obj_10)
   added: (pred_1 obj_14 obj_09) (pred_2 obj_12 obj_10)
   goals met: 4 of 4
